/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strcmp.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: woosupar <woosupar@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/17 16:25:44 by woosupar          #+#    #+#             */
/*   Updated: 2024/06/17 16:28:36 by woosupar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

// 동일 문자열이면 0 아니면 1, 널문자로 오류면 -1 리턴

int	ft_strcmp(char *s1, char *s2)
{
	if (s1 == 0 || s2 == 0)
		return (-1);
	if (*s1 == '\0' && *s2 == '\0')
		return (0);
	while (*s1 != '\0' && *s2 != '\0')
	{
		if (*s1 == *s2)
		{
			s1++;
			s2++;
		}
		else
			return (1);
	}
	if (ft_strlen(s1) == ft_strlen(s2))
		return (0);
	else
		return (1);
}
